In [2]:
import pandas as pd
import numpy as np

## Data Loading
- 엑셀 핸들링 할 때 사용
- xlrd module이 없을 경우 conda install xlrd

# 1. Selection & Drop
: 데이터 선택 , 삭제
### 1.1 Selection with column names
- column 이름 없이 사용하는 index number는 row 기준 표시
- 데이터 많은 거 볼 때 head().T이용 하면 보기 쉬움
- 한개의 column 선택시

In [ ]:
# 일종의 Series data 반환
df["account"].head(3)

- 1개 이상의 column 선택 시 list 형태로

In [ ]:
df[["account","street","state"]].head(3)

- column name과 함께 row index 사용시, 해당 column만

In [ ]:
df["account"][:3]

### 1.2 Selection with index number

In [ ]:
account_serires = df["account"]
account_serires [:3] #account에서 0~2까지의 index인 data Series 형태로 추출
account_serires[[0,1,2]] #1개 이상의 index

In [ ]:
# Boolean Index : True인 경우의 data만 출력
account_serires[account_serires<250000]

### 1.3 Index 변경

In [ ]:
df. index = df["account"] # Index 값 지정 
del df["account"] # 기존의 index 삭제 
df.head()

### 1.4 basic, loc, iloc selection

- column과 index number

In [ ]:
df[["name","street"]][:2] # name과 street column에 대해서 0~2인 index를 가지는 Row 출력

In [ ]:
df.loc[[211829,320563],["naem","street"]] # [[Row/index 이름],[Column]]

- Column number와 index number

In [ ]:
df.iloc[:2,:2]

### 1.5 index재설정

In [ ]:
# 첫번째 방법
df.index = list(range(0,15))
# 두번째 방법 : 값 자체는 변하지 않지만 index 새로 한개 더 생성, df 자체는 변하지 X
df.reset_index() 
# If 기존의 index 삭제 시
df.reset_index(drop = True)
# 세번째
df.reset_index(inplace = True) # df 자체가 변함

### 1.6 Data drop
- index number로 drop

In [ ]:
# drop은 기존의 것을 변화시키지 않음
df.drop(1)
# 한 개이상의 Index number로 drop
df.drop([0,1,2,3])
# axis 지정으로 축을 기준으로 drop 
df.drop("city", axis =1 ) # column 중에 "city" 삭제

- numpy 형태로 데이터 추출

In [ ]:
matrix = df.values

# 2. DataFrame Operations
### 2.1 Series Operation

In [7]:
from pandas import Series, DataFrame

In [8]:
s1 = Series(range(1,6), index = list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [11]:
s2 = Series(range(5,11), index = list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

- index 기준으로 연산수행
- 겹치는 index가 없을 경우 Nan값으로 반환

In [12]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [13]:
s1+s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

### 2.2 DataFrame Operation
- df는 column과 index를 모두 고려
- add operation을 쓰면 Nan값 0으로 변환
- Operation types : add, sub, div, mul

In [14]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns= list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [16]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

- fill_value = 0 : Nan인 data를 0으로 대신 연산시켜줘서 Nan 값이 안나오게 함

In [18]:
df1.add(df2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### 2.3 Series + DataFrame

In [19]:
df = DataFrame( np.arange(16).reshape(4,4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [21]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

- axis 기준으로 row broadcasting 실행

In [24]:
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

# 3. lambda, map, apply
### 3.1 map for series
- pandas의 series type의 data에도 map 함수 사용 가능
- function 대신 dict, sequence형 자료 등으로 대체 가능

#### 3.1.1 lambda

In [26]:
s1 = Series( np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [27]:
s1.map(lambda x : x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [36]:
f = lambda x, y: x+y
f(1,4)

5

In [37]:
def f(x,y):
    return x + y

In [38]:
f = lambda x : x **2
f(3)

9

In [39]:
f = lambda x : x+ 5
f(3)

8

In [40]:
(lambda x : x + 1)(5)

6

#### 3.1.2 map
- dict type으로 data 교체
- 없는 값은 Nan

In [28]:
z = {1: 'A', 2: 'B', 3 : 'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

- 같은 위치의 데이터를 s2로 전환

In [29]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [41]:
ex = [1,2,3,4,5]
f = lambda x : x **2
list(map(f,ex))

[1, 4, 9, 16, 25]

In [42]:
f = lambda x, y: x+y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [43]:
list(map(lambda x : x+5, ex))
# Python 3 에는 list를 꼭 붙여줘야 함

[6, 7, 8, 9, 10]

### 3.2 example - map for series

In [48]:
df = pd.read_csv("https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [49]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [51]:
def change_sex(x):
    return 0 if x =="male" else 1

df.sex.map(change_sex) # sex값 자체에는 변화 X

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

### 3.3 replace function
- Map 함수의 기능 중 데이터 변환 기능만 담당
- 데이터 변환 시 많이 사용하는 함수
- inplace : 데이터 변환 결과 적용

In [52]:
# dict type 적용
df["sex_code"] = df.sex.map({"male" : 0, "female": 1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [54]:
 # sex값 자체가 바뀌지는 않음!!
 df.sex.replace({"male" : 0, "female": 1})

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [56]:
 # Target list conversion list
 df.sex.replace(["male","female"],[0,1], inplace = True)
 df

              earn  height  sex   race  ed  age  sex_code
0     79571.299011   73.89    0  white  16   49         0
1     96396.988643   66.23    1  white  16   62         1
2     48710.666947   63.77    1  white  16   33         1
3     80478.096153   63.22    1  other  16   95         1
4     82089.345498   63.08    1  white  17   43         1
...            ...     ...  ...    ...  ..  ...       ...
1374  30173.380363   71.68    0  white  12   33         0
1375  24853.519514   61.31    1  white  18   86         1
1376  13710.671312   63.64    1  white  12   37         1
1377  95426.014410   71.65    0  white  12   54         0
1378   9575.461857   68.22    0  white  12   31         0

[1379 rows x 7 columns]

In [58]:
df.drop("sex_code", axis =1, inplace=True)

In [59]:
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

### 3.4 apply for dataframe
- map과 달리 series 전체(column)에 해당 함수 적용
- 입력 값이 Series data로 입력 받아 handling 가능

In [60]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [61]:
# 각 column 별로 결과값 반환
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

- 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음
- mean, std 등 사용 가능

In [62]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [63]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

- scalar 값 이외에 series 값의 반환도 가능

In [64]:
def f(x):
    return Series([x.min(), x.max()], index = ["min","max"])

df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

### 3.5 applymap for dataframe
- series 단위가 아닌 element 단위로 함수를 적용
- series 단위에 apply를 적용시킬 때와 같은 효과

In [65]:
f = lambda x : -x
df_info.applymap(f).head(5) # 모든 element에 적용

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [66]:
f = lambda x : -x
df_info["earn"].apply(f).head(5) #map과 같은 효과

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

# 4. pandas built-in functions 
: 이미 가지고 있는 함수 <br>
### 4.1 describe
- Numeric type data의 요약 정보를 보여줌

In [84]:
df = pd.read_csv("https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [98]:
df.dtypes

earn      float64
height    float64
sex        object
race       object
ed          int64
age         int64
dtype: object

In [69]:
df.describe()

                earn       height          sex           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640     0.622915    13.354605    45.328499
std     31257.070006     3.818108     0.484832     2.438741    15.789715
min       -98.580489    57.340000     0.000000     3.000000    22.000000
25%     10538.790721    63.720000     0.000000    12.000000    33.000000
50%     26877.870178    66.050000     1.000000    13.000000    42.000000
75%     44506.215336    69.315000     1.000000    15.000000    55.000000
max    317949.127955    77.210000     1.000000    18.000000    95.000000

### 4.2 unique
-series data의 유일한 값을 list로 반환

In [85]:
# 유일한 인종의 값 list
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [86]:
# dict type으로 index
np.array(dict(enumerate(df["race"].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [87]:
# label index 값과 label 값 각각 추출
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype = str)[:,1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [99]:
# label str -> index 값으로 변환
df["race"].replace(to_replace=key, value = value, inplace = True)

In [102]:
# label index 값과 label 값 각각 추출
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype = str)[:,1].tolist()

value, key

([0, 1], ['male', 'female'])

In [103]:
df["sex"].replace(to_replace = key, value = value, inplace=True)
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

### 4.3 Sum
- 기본적인 column 또는 row 값의 연산을 지원
- sub, mean, min, max, count, median, mad, var 등

In [104]:
# column 별
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [108]:
numeric_cols = ["earn", "height", "ed", "age"]
df[numeric_cols].sum()

earn      4.474344e+07
height    9.183125e+04
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [105]:
# row 별
df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80654.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [109]:
# Row단위
numeric_cols = ["earn", "height", "ed", "age"]
df[numeric_cols].sum(axis=1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

### 4.4 isnull
- column 또는 row 값의 Nan(null)값의 index를 반환함

In [106]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [107]:
# Null인 값의 합
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [119]:
# 중간에 ... 없애줄 수 있음
pd.options.display.max_rows = 100

In [120]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

### 4.5 sort_values
- column 값을 기준으로 data sorting

In [93]:
# ascending = True -> 오름차순, Flase -> 내림차순
df.sort_values(["age","earn"], ascending = True).head(10)

             earn  height     sex      race  ed  age
1038   -56.321979   67.81    male  hispanic  10   22
800    -27.876819   72.29    male     white  12   22
963    -25.655260   68.90    male     white  12   22
1105   988.565070   64.71  female     white  12   22
801   1000.221504   64.09  female     white  12   22
862   1002.023843   66.59  female     white  12   22
933   1007.994941   68.26  female     white  12   22
988   1578.542814   64.53    male     white  12   22
522   1955.168187   69.87  female     black  12   22
765   2581.870402   64.79  female     white  12   22

### 4.6 Correlation & Covariance
- 상관계수와 공분산을 구하는 함수
- corr, cov, corrwith

In [94]:
# age와 earn 의 상관계수
df.age.corr(df.earn)

0.07400349177836058

In [95]:
# 공분산
df.age.cov(df.earn)

36523.69921040891

In [96]:
# earn과 나머지 전체값간의 상관계수
df.corrwith(df.earn)

earn      1.000000
height    0.291600
ed        0.350374
age       0.074003
dtype: float64

In [97]:
# 전체 상관계수
df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000

In [121]:
(df.age<45) & (df.age>15)

0       False
1       False
2        True
3       False
4        True
        ...
1374     True
1375    False
1376     True
1377    False
1378     True
Name: age, Length: 1379, dtype: bool

In [122]:
df.age[(df.age<45) & (df.age>15)]

2       33
4       43
5       30
8       25
9       30
        ..
1369    24
1373    40
1374    33
1376    37
1378    31
Name: age, Length: 772, dtype: int64

In [123]:
df.age[(df.age<45) & (df.age>15)].corr(df.earn)

0.3141178872518903

In [124]:
df["sex_code"] = df["sex"].replace({"male":1, "female" : 0})

In [126]:
df

              earn  height  sex  race  ed  age  sex_code
0     79571.299011   73.89    0     0  16   49         0
1     96396.988643   66.23    1     0  16   62         1
2     48710.666947   63.77    1     0  16   33         1
3     80478.096153   63.22    1     1  16   95         1
4     82089.345498   63.08    1     0  17   43         1
...            ...     ...  ...   ...  ..  ...       ...
1374  30173.380363   71.68    0     0  12   33         0
1375  24853.519514   61.31    1     0  18   86         1
1376  13710.671312   63.64    1     0  12   37         1
1377  95426.014410   71.65    0     0  12   54         0
1378   9575.461857   68.22    0     0  12   31         0

[1379 rows x 7 columns]

In [129]:
df.sex.value_counts(sort=True) / len(df)

1    0.622915
0    0.377085
Name: sex, dtype: float64